#include <stdio.h>
#include <time.h>
#include <windows.h>
#include <stdlib.h>
#include <conio.h>

#define Up 72
#define Down 80
#define Left 75
#define Right 77

// 게임 시작하는순간 따로방향키 입력이 없으면 벽이나올때 까지 앞으로 계속이동 게임자체는 while문으로 구성.

	char map[15][40] ={
	{"1111111111111111111111111111111111111111"},
	{"1P00000000000000000000000000000000000001"},
	{"1000000000000000000000000000000000000001"},
	{"1000000000000000000000000000000000000001"},
	{"1000000000000000000000000000000000000001"},
	{"1000000000000000000000000000000000000001"},
	{"1000000000000000000000000000000000000001"},
	{"1000000000000000000000000000000000000001"},
	{"1000000000000000000000000000000000000001"},
	{"1000000000000000000000000000000000000001"},
	{"1000000000000000000000000000000000000001"},
	{"1000000000000000000000000000000000000001"},
	{"1000000000000000000000000000000000000001"},
	{"1000000000000000000000000000000000000001"},
	{"1111111111111111111111111111111111111111"},
	};
void CreateMap()
{
	system("cls");
	int h, w;

	for (int h = 0; h < 15; h++)
	{
		for (int w = 0; w < 40; w++)
		{
			char temp = map[h][w];
			if (temp == '0')
				printf("*");
			else if(temp == '1')
				printf("#");
			else if(temp == 'P')
				printf("C");
		}
		printf("\n");
	}
}

void MoveInput()
{
	int key;
	while (0)
	{
		if (_kbhit())
		{
			key = _getch();
			if (key == 224)
				key = _getch();
			switch (key)
			{
			case Up:
				printf("위 방향키\n");
				break;
			case Down:
				printf("아래 방향키\n");
				break;
			case Left:
				printf("왼쪽 방향키\n");
				break;
			case Right:
				printf("오른쪽 방향키\n");
				break;
			default:
				break;
			}
		}
	}

}

// 

void main() {
	CreateMap();
	MoveInput();
}