/*
* 1. 지각비 : 1분 늦으면 1000원 부터...5분당 1000원씩 할증. - 변명 금지. 지하철 파업 : 인증 필요.
*             권유노의 시계에 맞추어서 판정.
              40분까지면 40분 59.99999초까지 세이브. 신체의 일부가 강의장에 있으면 됨.
* 2. 수업 중 태도 : 딴짓 금지. 만약 딴짓하면 강사는 맨 뒷자리에서 수업할 것임.
*                   옆자리 딴짓을 신고하면 1000원을 공금에서 가져올 수 있음.
* 3. 결석 : 진단서, 아니면 의사와 셀카
* 4. 교실 내 규칙 : 쌍욕 금지. 안돌아가면 본인 탓. "해줘" 금지. "살려줘" 환영.
*/

#include "stdio.h"
/*stdio 는  standard input output의 약자이다. */
/* 함수에는 출력이 있는 함수와 없는 함수가 있다. */
/* 반환값이 없는 함수를 void라고 한다. */
void main() {
	printf("Hello World!");
}